---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsSupportTooShort
source: html/d0f0b991-1355-714d-e7e8-335a4c182d72.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsSupportTooShort Property

A short support is being created.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsSupportTooShort { get; }
```